Documents/А_ФинРез_Баланс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_ФинРез_Баланс</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.А_ОтчетБаланс_Свод</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьДочерние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/А_ОтчетБаланс_Свод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>А_ОтчетБаланс_Свод</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНачальныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПриход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКонечныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектыЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДенежныеСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ИсточникБаланса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/А_ФинРез_Баланс/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем мТЗСвод;

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = А_Привилегированный.А_ПолучитьОрганизациюУпр();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Месяц) Тогда
		Месяц = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НачМесяца = НачалоМесяца(Месяц);
	КонМесяца = КонецМесяца(Месяц);

	// --- Дублікат-захист ---
	ЗапросДубль = Новый Запрос;
	ЗапросДубль.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1 ФР.Номер КАК Номер, ФР.Дата КАК Дата
	|ИЗ Документ.А_ФинРез_Баланс КАК ФР
	|ГДЕ ФР.Ссылка <> &ТекущийДок И НЕ ФР.ПометкаУдаления И ФР.Проведен
	|	И ФР.Организация = &Организация
	|	И ФР.Месяц МЕЖДУ &НачМесяца И &КонМесяца
	|	И ФР.ВключатьДочерние = &ВключатьДочерние";
	ЗапросДубль.УстановитьПараметр("ТекущийДок",       Ссылка);
	ЗапросДубль.УстановитьПараметр("Организация",      Организация);
	ЗапросДубль.УстановитьПараметр("НачМесяца",        НачМесяца);
	ЗапросДубль.УстановитьПараметр("КонМесяца",        КонМесяца);
	ЗапросДубль.УстановитьПараметр("ВключатьДочерние", ВключатьДочерние);
	РезДубль = ЗапросДубль.Выполнить();
	Если НЕ РезДубль.Пустой() Тогда
		ВыбДубль = РезДубль.Выбрать(); ВыбДубль.Следующий();
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон("Не можна провести: за %1 (Організація %2) вже проведено документ %3 від %4.",
				Формат(НачМесяца, "ДФ='ММММ yyyy'"), Организация, ВыбДубль.Номер,
				Формат(ВыбДубль.Дата, "ДФ='dd.MM.yyyy'")));
		Отказ = Истина; Возврат;
	КонецЕсли;

	СтруктураШапки = Новый Структура;
	СтруктураШапки.Вставить("Ссылка",           Ссылка);
	СтруктураШапки.Вставить("Дата",             Дата);
	СтруктураШапки.Вставить("НачМес",           НачМесяца);
	СтруктураШапки.Вставить("КонМес",           КонецДня(КонМесяца));
	СтруктураШапки.Вставить("Организация",      Организация);
	СтруктураШапки.Вставить("ВключатьДочерние", ВключатьДочерние);
	ПровестиБалансСвод(СтруктураШапки, Отказ);
КонецПроцедуры

#КонецОбласти

#Область Оркестратор

// Модульная свёртка (канон v2): суммы из ОСНОВНОЙ таблицы ПрочиеАктивыПассивы
// per Источник (Перечисление.ИсточникиУправленческогоБаланса), затем СверкаСПАП
// приводит Σ по (Орг,Подр,Статья) к ПАП.ОстаткиИОбороты до копейки
// (обрезка/добивка, флаг Расхождение). Типовые регистры — только чтение.
Процедура ПровестиБалансСвод(СтруктураШапки, Отказ) Экспорт
	Движения.А_ОтчетБаланс_Свод.Записывать = Истина;
	мТЗСвод = Движения.А_ОтчетБаланс_Свод.Выгрузить();
	мТЗСвод.Очистить();

	// per-Источник процедуры (раскомментируются Task 5-10):
	// Свод_РасчетыСПартнерами(СтруктураШапки, Отказ);
	// Свод_СебестоимостьТоваров(СтруктураШапки, Отказ);
	// Свод_ДенежныеСредства(СтруктураШапки, Отказ);
	// Свод_ПрочиеРасходыДоходы(СтруктураШапки, Отказ);
	// Свод_ПрочиеАктивыПассивы_Прямой(СтруктураШапки, Отказ);
	// Свод_ОплатаТруда(СтруктураШапки, Отказ);

	СверкаСПАП(СтруктураШапки);   // Task 11

	мТЗСвод.Свернуть(
		"Организация,Подразделение,Статья,Номенклатура,Контрагент,Партнер,Склад,"
		+ "ОбъектыЭксплуатации,Договор,ФизическоеЛицо,ДенежныеСредства,Source,"
		+ "Расхождение,Аналитика1,Аналитика2,Аналитика3,ОбъектРасчетов,"
		+ "НематериальныйАктив,ДокументДвижения",
		"СуммаНачальныйОстаток,СуммаПриход,СуммаРасход,СуммаКонечныйОстаток");
	Движения.А_ОтчетБаланс_Свод.Загрузить(мТЗСвод);
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИсточников
// Свод_* добавляются Task 5-10 (каждая — свой запрос к ОСНОВНОЙ таблице ПАП
// по своему Источник, субконто, ДокументДвижения=Регистратор, → Отразить_Свод).
#КонецОбласти

#Область СлужебныеПроцедуры

Процедура Отразить_Свод(Таблица) Экспорт
	Для Каждого СтрТЗ Из Таблица Цикл
		ЗаполнитьЗначенияСвойств(мТЗСвод.Добавить(), СтрТЗ);
	КонецЦикла;
КонецПроцедуры

Функция ИсключенныеСтатьи() Экспорт
	З = Новый Запрос;
	З.Текст =
	"ВЫБРАТЬ Ссылка КАК Ссылка ИЗ ПланВидовХарактеристик.СтатьиАктивовПассивов
	|ГДЕ Наименование В (&Имена)";
	З.УстановитьПараметр("Имена", СтрРазделить(
		"Собственные средства,Доходы текущего периода,Расходы текущего периода", ","));
	Возврат З.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

Функция СтатьяОплатаТруда() Экспорт
	З = Новый Запрос;
	З.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка КАК Ссылка
	|ИЗ ПланВидовХарактеристик.СтатьиАктивовПассивов ГДЕ Наименование = ""Оплата труда""";
	В = З.Выполнить().Выбрать();
	Возврат ?(В.Следующий(), В.Ссылка,
		ПланыВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка());
КонецФункции

Процедура СверкаСПАП(СтруктураШапки)
	// Реализуется Task 11 (обрезка/добивка/Расхождение, инвариант Σ==ПАП).
КонецПроцедуры

#КонецОбласти

#КонецЕсли
